In [11]:
import pandas as pd
import numpy as np

In [12]:
#Median - based anomaly detection        ايجاد القيم الشاذه باستخدام الوسيط و العنصر

x = pd.Series([2.1, 2.3, 4.5, 2.2, 2.4] )
median = np.median(x)
threshold = 2
outleirs = []

for item in x:
    if abs(item - median) > threshold :
        outleirs.append(item)
print(outleirs)

[4.5]

In [13]:
#Mean - based anomaly detection        ايجاد القيم الشاذه باستخدام المتوسط و الانحراف المعياري 

x = pd.Series([2.1, 2.3, 4.5, 2.2, 2.4] )
mean = np.mean(x)
std = np.std(x)
outleirs = []

for item in x:
    if (item < mean - std) or (item > mean + std):
        outleirs.append(item)
        
print(outleirs)

[4.5]

In [14]:
#z_score - based anomaly detection

x = pd.Series([2.1, 2.3, 4.5, 2.2, 2.4] )
mean = np.mean(x)
std = np.std(x)
outleirs = []

for item in x:
    z_score = (item - mean )/ std
    if z_score > 1.5:
        outleirs.append(item)
print(outleirs)

[4.5]

In [15]:
#Interquartile for anomaly detection       ايجاد القيم الشاذه باستخدام الربع الربيعي

x = pd.Series([2.1, 2.3, 4.5, 2.2, 2.4] )
Q1, Q3 = np.percentile(x, [25, 75])
IQR = Q3 - Q1
outleirs = []

for item in x:
    if item < (Q1 - 1.5 * IQR) or item > (Q3 + 1.5 * IQR):
        outleirs.append(item)
print(outleirs)

[4.5]

In [16]:
from numpy import NaN
data1 = {'Name': ['Ahmed', 'Sayed', 'Noha', 'yasmeen'], 'Age': [22, 34, NaN, 14]}

In [24]:
data = pd.DataFrame.from_dict(data1)
data

      Name   Age
0    Ahmed  22.0
1    Sayed  34.0
2     Noha   NaN
3  yasmeen  14.0

In [18]:
data.isnull()

    Name    Age
0  False  False
1  False  False
2  False   True
3  False  False

In [19]:
data.isnull().sum()

Name    0
Age     1
dtype: int64

In [20]:
data.dropna(inplace = True)     #if the missing values is small , we can delete the row 
data

      Name   Age
0    Ahmed  22.0
1    Sayed  34.0
3  yasmeen  14.0

In [27]:
from numpy import NaN
data2 = {'Name': ['Ahmed', 'Sayed', 'Noha', 'yasmeen'], 'Age': [22, 34, NaN, 14]}
datax = pd.DataFrame.from_dict(data2)
datax

      Name   Age
0    Ahmed  22.0
1    Sayed  34.0
2     Noha   NaN
3  yasmeen  14.0

In [28]:
#if the missing values is too many , we can replace it by mean , median and mode
datax.fillna(data.mean(), inplace = True)
datax

C:\Users\LAPCOM~1\AppData\Local\Temp/ipykernel_1704/1714590364.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  datax.fillna(data.mean(), inplace = True)

      Name        Age
0    Ahmed  22.000000
1    Sayed  34.000000
2     Noha  23.333333
3  yasmeen  14.000000

In [35]:
data['Age'].fillna(data['Age'].mode()[0], inplace = True)
data

      Name        Age
0    Ahmed  22.000000
1    Sayed  34.000000
2     Noha  23.333333
3  yasmeen  14.000000

In [37]:
import re

In [38]:
txt = 'python is my favourite programming language , I love python. '
x = re.findall('python', txt)
print(x)

['python', 'python']

In [39]:
len(x)

2